example-configs/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" dumptraffic="protocol">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="20"/>
  </clients>
  
  <servers>
    <server host="myserver" port="80" type="tcp"/>
  </servers>

  <monitoring>
    <monitor host="myserver" type="snmp"/>
  </monitoring>
  
  <load duration="10" unit="second">
    <arrivalphase phase="1" duration="10" unit="second">
      <users maxnumber="10" arrivalrate="10" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <for from="1" to="10" var="i">
        <request> <http url="http://test.loadimpact.com/" method="GET" version="1.1"></http> </request>
      </for>
    </session>
  </sessions>

</tsung>